#include <stdio.h>


int main(void)
{
    // Оголошення змінних різних типів даних, закінчцюється крапкою з комою. Компілятор розуміє, що це кінець інструкції.
    // Максимальна кількість символів у назві змінної - 63 символи в середині модуля та 31 за межами модуля. Назва змінної повинна починатися з літери або символу підкреслення, а не з цифри.
    char byte_memory; // Займає 1 байт(8 бітів) пам'яті. 0 до 255 (без знаку) або -128 до 127 (зі знаком).
    short short_memory; // Займає 2 байти (16 бітів) пам'яті. -32,768 до 32,767.
    int int_memory; // Займає 4 байти (32 біти) пам'яті. -2,147,483,648 до 2,147,483,647.
    long long_memory; // Займає 8 байтів (64 біти) пам'яті. -9,223,372,036,854,775,808 до 9,223,372,036,854,775,807.

    // unsigned - це модифікатор типу даних, який вказує, що змінна може зберігати лише невід'ємні значення. Наприклад, unsigned char може зберігати значения от 0 до 255.
    // signed - це модифікатор типу даних, який вказує, що змінна може зберігать як позитивні так і відємні значення. 
    // short, int, long и long long - за замовчуванням є signed. char може бути як signed, так і unsigned, залежно від реалізації компілятора.

    float float_memory; // Займає 4 байти (32 біти) пам'яті. Приблизно 6-7 десяткових цифр точності.
    double double_memory; // Займає 8 байтів (64 біти) пам'яті. Приблизно 15-16 десяткових цифр точності.
    long double long_double_memory; // Займає 16 байтів (128 битів) пам'яті. Приблизно 18-19 десяткових цифр точности.


    char a; 
    a = byte_memory; // Відбуваєтьсяся копіювання значення 100 в окрему область пам'яті, яка відведена для змінної a. Тепер a також містить значення 100.

    return 0;
}
