#include <stdio.h>


int main(void)
{
    int var;
    int size, weight;
    int total = 1024;  // ініціалізація змінної
    var = 100; // = операція присвоювання, і ; дає комапілятору зрозуміти що вираз завершено.
    size = weight = 200;  // присвоєння значення для декількох змінних
    
    int dec, hex, oct;
    dec = 100; // десятичне чисо
    hex = 0x1FA; // шіснадцятичне число(506), починається з 0х
    oct = 0122; // восьмиричне число(82), починається з 0

    // char може придставляти як ціле число так і символ
    char ch; 

    ch = 's'; // обовязково вказувати символ в одинарних лапках, int(115) в таблиці ASCII

    /*
    Можна і int ch; ch = 's'; на рівні програми символи зберігаються як коди ASCII. 
    Але краще при роботі з символами використовувати char так як він займає 1 байт
    */ 

    printf("ch = %c, code = %d\n", ch, ch);  // ch = s, code = 115

    double d1, d2, d3, d4;
    
    d1 = 10.0f; // якщо вказати суфікс f, число стане float який займає менше памяті 4 байти, double 8 байтів
    d2 = -7.;
    d3 = 1e2; // 1 * 10 в квадраті = 100
    d4 = 5e-3; // 5 * 10 в -3 степені = 0,005

    // sizeof(<тип або імя змінної>); повертає кількість байт скільки займає змінна або тип
    int size_float = sizeof(float);

    return 0;

}