#include <stdio.h>
// Функції введення та виведення
// При запуску необхідно ввести 4 символи, головна функція зчитує 4 байти з буферу


int main(void)
{
    // getchar -  читає 1 байт з буферу прийому, повертає [0; 255], може і -1(EOF=-1 End of File)
    int value = getchar(); // вводимо на клавіатурі 1 символ
    // putchar - вивід 1 байту(символу) у вихідний потік
    int res = putchar(value);
    // якщо ввести f, то спочатку putchar виведе f асоціюючи вивід з монітором а потім value = 102, res = 102
    printf("\nvalue = %d, res = %d\n", value, res);

    /*
    printf(const char*, format, ...); - print formatted

    Специфікатори перетворень
    Важливо!!! Отриманні дані мають збігатись з специфікаторами інакше неочікувана поведінка
    %d %i - ціле число зі знаком в десятковій формі, типи char short нормально відображаються приводиться до типу int
    %u - ціле беззнакове в десятковій формі
    %o - ціле беззнакове вісьмковій формі
    %x %X - ціле беззнаковве число в шіснадцятковій формі
    %f %F - дійсні числа в вигляді десяткового дробу
    %e %E - дійсні числа в експоненціальній формі
    %c - символи відповідний кодовій таблиці ASKII
    %s - стрічка, послідовність символів
    %% - запис самого символу %

    l - суфікс для типів long - %ld
    ll - суфікс для типів lonl long - %lld
    L - суфікс дл типу long double - %Lf
    */
    
    int var_i = 1001;
    printf("var_d = %d\n", var_i);  // var_d = 1001
    printf("var_x = %x\n", var_i);  // var_x = 3e9 - вказали х, специфікатор перетворень перетворив з десяткового в шіснадцяткове

    double var_d = 1002;
    printf("var_f = %f\n", var_d);  // var_f = 1002.000000

    short var_s = 100;
    int var_ii = -1024;
    long double var_ld = 5.5;
    
    printf("var_s = %d, var_ii = %d, var_ld = %Lf\n", var_s, var_ii, var_ld);

    /*
    Прапорці специфікаторів
    Десяткове число - вказує мінімальну ширину поля інформації що виводиться
    Знак << - >> - вирівнювання по правому краю
    Знак << + >> - відображає числа з знаками плюса або мінуса.
    Число 0 - заповнює нулями вільні області
    Пробіл - позитивні числа з пробілом на початку, відємні зі знаком мінуса
    Знак << # >> - відображає префікс числа, наприклад 0х для шіснадцяткових чисел
    */

    int var_1 = -1234;
    double var_2 = 55.32;

    printf("[%10d]\n", var_1); // [     -1234]
    printf("[%-10d]\n", var_1); // [-1234     ]
    printf("[%10f]\n", var_2); // [ 55.320000]
    printf("[%12.7d]\n", var_1); // [    -0001234] .7 - для цілого числа, ширина значень що відображаються
    printf("[%12.2f]\n", var_2); // [       55.32] .2 - для дійсного числа, вивід знаків після крапки

    /*
    int scanf(const char* format, ...); - функція читання форматованих даних із стандартного вхідного потоку stdin
    Специфікатори перетворень таккі як і для функції printf
    */

    /*
    %c - читає один байт із буферу входного потоку, якщо в буфері 2 байти то прочитається тільки перший
    &byte - знак амперсанту & повертає адресу змінної byte куди ми запишимо отримане значення
    Якщо дані були успішно отриманні та записані то функція scanf поверне 1 так як прочитала 1 елемент данних
    */
    char byte;
    int count = scanf("%c", &byte); // вводимо на клавіатурі 1 символ, якщо 2 буде прочитано тільки перший другий залишиться в буфері
    printf("count = %d, byte =%c\n", count, byte);

    
    char byte1 = '0', byte2 = '0';
    int res_scan = scanf("%c%c", &byte1, &byte2); // вводимо на клавіатурі 2 символи
    printf("res_scan = %d, byte1 = %c, byte2 =%c\n", res_scan, byte1, byte2);

    /*
    scanf("%c %c", &byte1, &byte2); - пробіл між "%c %c" очікує будь який пробільний символ між символами, стрічку типу f f
    scanf("%c,%c", &byte1, &byte2); - кома між "%c,%c" очікує стрічку типу f,f
    "%c%с; %c%с" - очікуватиме стрічку по типу ab; cd
    "%*llu; %u; %lf" - вводимо 10; 1000; 54.33, * означає що дані прочитано з буферу але ми їх пропускаємо і нікуди не записуємн
    */
    
    return 0;
}