#include <stdio.h>
/*
Арифметичні операції.
Приорітети, більший приріоритет викоконується першим
+ | 1
- | 1
* | 2
/ | 2
% | 2
++ | 3
-- | 3
*/

int main(void)
{
    short a = -5;
    int b = 10;
    float c = 5.5f;
    double d = -6.7;

    int res_1 = a + b; // Дозволяє додавати різні типи, компілятор спочатку приводить до типу інт
    float res_2 = 5.4 - c;
    double res_3 = d * 3;  // Трійка спочатку приводиться до типу double потім виконується операцію множення

    int res_4 = 7 / 2;  // буде 3 так як тип інт, знаки після коми відкидаються а не заокруглюються
    int res_6 = -9 / 2; // -4
    float res_7 = a / c;  // -0.9259...

    /*
    Результат 0 а не 0.5 так як відбувається ділення між цілими числами.
    Результатом ділення буде також ціле число яке потім запишиться в double
    */
    double res_8 = a / b; // 0
    double res_9 = (double)a / (double)b;  // -0.5 Правильно, змінні спочатку перетворятья в double

    /*
    Можна записувати вирази.
    У операцій є різний приріоритет. Наприклад спочатку множення потім додавання. 
    Спочатку вирахується в дужках потім операція множення після чого аж додавання
    */
    int res_10 = 5 + 10 * (3 + 2);  
    int res_11 = 5 / 3 * 2; // (5 / 3) * 2 Якщо у операцій однаковий приріоритет то виконуються з ліва на право.

    // % - ділення по модулю(залишок від ділення), тільки з цілими числами
    int res_12 = 10 % 3; // 1
    int res_13 = -10 % 4;  // -2 якщо ліве значення відємне то і результат відємний
    int res_14 = 10 % -4;  // 2

    // Інкримент ++, декримент --. Збільшення і зменшення на 1. Можна застосувати до змінюваної області памяті, для констант заборонено.
    int count = 10;
    count = count + 1; // 11 
    count++; // 12 короткий спосіб, працює трохи швидше
    count--; // 11

    int count_1 = 0, size = 5;
    int current = count_1++;  // Спочатку присвоюється значення потім збільшення на 1
    int width = ++size;  // Спочатку збільшуємо на 1 потім присвоюємо

    printf("count_1 = %d, size = %d, current = %d, width = %d\n", count_1, size, current, width); // count_1 = 1, size = 6, current = 0, width = 6

    // Коротший вираз +=, -=, /= ...
    count_1 += 2;

    int count_3 = 3;
    count_3 -= 4-5;  // 3 - (4 - 5) = 4

    /*
    Вирази l-value можуть при кожному зверненні до них видавати різні області памяті.
    Наприклад l-value може бути масивом і індекси можуть вичислятись при кожному зверненні до нього, результат індекси можуть змінитись.
    <вираз l-value> = <вираз l-value> + 1; - тобто тут ми берем одну облать памяті додаємо 1 і можемо записати в іншу область памяті
    <вираз l-value> += 1; - тут ми зразу додаємо 1 до певної області памяті. Краще використовувати даний спосіб для виразів l-value.
    */

    return 0;
}