#include <stdio.h>
/*
Умовний тернарний вираз <вираз>?<вираз>:<вираз>
Якщо перший вираз true то повертається другий вираз інакше третій
*/

int main(void)
{
    int a = 4, b = -2;
    int max_ab;

    // Для визначення яке значення більше можна використати оператор if
    if(a > b)
        max_ab = a;
    else
        max_ab = b;
    
    /*
    Тернарний вираз є більш лаконічним. Результати той самий. 
    Оператор if виконує певний код.
    тернарний вираз повертає значенн вказані у виразі
    */
    int max_ab_1 = a > b ? a : b;
    
    int c = 8;
    printf("c is %s digit\n", (c % 2 == 0) ? "even" : "odd");  // вираховуємо якщо число є парним то повернути "even" інакше "odd" 
    // Вираз можна розміщати без круглих дужок але якщо використовувати круглі дужки то простіше читати.
    // Опереції можна вкладати одна в одну, приклад int max = (a > b) ? (a > c ? a : c) : (b > c) ? b : c;

    return 0;
}
