#include <stdio.h>

/*
Бітові операції. 
| 7 | 6 | 5 | 4 | 3 | 2 | 1 | 0 | - номерація бітів починається з 0, збільшується з права на ліво

НЕ(~) - iнвертує біти. Якщо було 0 то стане 1

І(&) - бітова операція, є бінарною застосовується до двох операндів x, y
Cходе на множення, якщо 0 * 1 = 0
x | y | І(&)
0 | 0 | 0
0 | 1 | 0
1 | 0 | 0
1 | 1 | 1

АБО(|) - схоже на додавання
x | y | АБО(|)
0 | 0 | 0
0 | 1 | 1
1 | 0 | 1
1 | 1 | 1

XOR(^) - виключне або, переключення
x | y | XOR(^)
0 | 0 | 0
0 | 1 | 1
1 | 0 | 1
1 | 1 | 0

Приріоритети. Приріоритет бітових операцій нижчий чим у операцій порівняння і значно нижчий чим у арифметичних
4 НЕ(~)
3 І(&)
2 XOR(^)
1 АБО(|)

>> зміщення біт вправо
<< зміщення біт вліво
Приріоритет вищий чим в операцій порівняння але менший ніж у арифметичних
*/


int main(void)
{
    // =============== НЕ(~) інвертує біти
    unsigned char var = 153;  // Двійкова     10011001
    unsigned char not_v = ~var; // Результат: 01100110 (число 102). 153 + 102 = 155, двійкова 11111111
    printf("var = %d, not_v = %d\n", var, not_v);


    /*
    =============== І(&)
    mask - в даному випадку є перевіркою чи другий біт увімкнутий 00000100, другий біт 1
    Якщо виконати flags & mask і у flags другий біт увімкнений, також 1 то результатом буде mask,
    так як якщо в бітах одиниці у обох випадкаж то результат 1 все інше 0.
    Маскою можна перевіряти також групу бітів
    */
    unsigned char flags = 5;  // Двійкова 00000101
    unsigned char mask = 4;   // Двійкова 00000100
    unsigned char  res = flags & mask; // 00000100
    printf("res = %d\n", res); // 4

    if( (flags & mask) == mask)
        printf("bit 2 is on");
    else
        printf("bit 2 is off");

    // Також можна вимикати біти з операцією НЕ. Вимикаємо 2 та 0 біти 
    unsigned char flags_off = 13;  // Двійкова             00001101       
    unsigned char mask_off = 5;    // Двійкова інвертована 11111010  00000101 = 5
    flags_off = flags_off & ~mask_off;     // flags_off =  00001000
    // ~ має більший приріоритет, спочатку інвертуємо 111111010, потім &
    printf("flags_off = %d\n", flags_off); // 8

    /*
    =============== АБО(|) - вмикаємо 2 та 0 біти
    Якщо 1 в одному із операндів то результат 1
    */
    unsigned char flags_on = 8;  // Двійкова 00001000
    unsigned char mask_on = 5;   // Двійкова 00000101
    flags_on = flags_on | mask_on;        // 00001101
    printf("flags_on = %d\n", flags_on); // 5 + 8 = 13 в даному випадку, так як не було щоб у двох операндів були одиниці(неважливо).
    
    // =============== XOR(^) - переключаємо 0 біт 
    unsigned char flags_switch = 9;   // Двійкова 00001001
    unsigned char mask_switch = 1;    // Двійкова 00000001
    flags_switch = flags_switch ^ mask_switch; // 00001000
    printf("flags_switch = %d\n", flags_switch); // 8 
    flags_switch ^= mask_switch; // Коротша форма, знову преемикаємо 0 біт отримаємо 9, число яке було спочатку.
    printf("flags_switch_2 = %d\n", flags_switch); // 9 
    // Можна використати для шифрування, так  як якщо будь яку маску примінити два рази то результатом буде початкове значення

    /*
    =============== >> << зміщення біт 
    Здвигаємо біти у певну сторона на n позицій
    По суті виконуємо цілочисленне ділення на 2 в степені n якщо >>. Тобто якщо здвиг 20 >> 2 то це 2 * 2 = 4, відповідно 20 / 4 = 5(дивитись приклад)
    Якщо << то по суті множення на 2 в степені n
    */

    // Приклад для беззнакових чисел
    unsigned char x = 40;  // 00101000 
    printf("x = %d\n", x);
    x = x >> 1;            // 00010100 (число 20)
    printf("x = %d\n", x);
    x = x >> 2;            // 00000101 (число 5)
    printf("x = %d\n", x);
    x = x >> 1;            // 00000010 (число 2)
    printf("x = %d\n", x);
    x = x >> 1;            // 00000001 (число 1)
    printf("x = %d\n", x);
    x = x << 1;            // 00000010 (число 2)
    printf("x = %d\n", x);
    x = x << 2;            // 00001000 (число 8)
    printf("x = %d\n", x);
    
    // Приклад для знакових чисел
    signed char y = -128;   // 1000 0000
    printf("y = %d\n", y);
    y = y << 1;
    printf("y = %d\n", y);  // 0000 0000

    y = -128; // Значення занулились тому знову переназначаємо змінну
    y = y >> 1;             // 1100 0000 (-64) - старший знаковий біт дублюється, в нас це 1
    printf("y = %d\n", y);  


    return 0;
}