#include <stdio.h>
#include <stdlib.h>
#include <time.h>

/*
Псевдо рандомні числа
stdlib.h - функція rand та константа RAND_MAX
RAND_MAX >= 32767
*/

int main_1(void)
{

    int r_1 = rand();
    int r_2 = rand();
    int r_3 = rand();

    printf("%d, %d, %d\n", r_1, r_2, r_3);
    
    /*
    41, 18467, 6334 - кожен раз числа будуть однакові при запуску програми так як вони є псевдорандомними
    Алгоритм генерації формує ії на певному стані регістрів при кожному запуску.
    */

    return 0;
}

int main(void)
{
    // Як отримати рандомні числа при кожному запуску?

    time_t t = time(NULL); // За допомогою функції time будемо отримувати час на момент запуску в секундах
    srand(t); // Дана функція дає змогу вказати "зерно" на основі якого будуть формуватись рандомні числа

    int range_1 = 10;
    
    int r_1 = rand() % range_1;  // Отримаємо значення [0; range] від 0 до 9
    int r_2 = rand() % range_1 - 5; // Отримаємо відємні значення [-5; range -5] від -5 до 4
    int r_3 = rand() + rand(); // Отримаємо діапазон в два рази більший

    // Отримати дійсне рандомне число
    double range_float = (double)rand() / (double)RAND_MAX; // Отримаємо значення [0; 1]
    
    printf("%d, %d, %d\n range_float = %.4f", r_1, r_2, r_3, range_float);

    return 0;
}