#include <stdio.h>

/*
Вказівник - це змінна, яка зберігає адресу іншої змінної. 
Вказівники дозволяють працювати з пам'яттю більш гнучко та ефективно. 
Вони використовуються для динамічного виділення пам'яті, передачі великих структур даних у функції та реалізації складних структур даних, таких як списки та дерева.
& - оператор взяття адреси, який повертає адресу змінної.
* - оператор розіменування, який дозволяє отримати значення змінної,на яку вказує вказівник.

*/

int main(void)
{
    int var = 100; // ініціалізація змінної, присвоєння значення при оголошенні
    int *ind; // оголошення вказівника, який може зберігати адресу змінної типу int
    ind = &var; // присвоєння адреси змінної var вказівнику ind, оператор & отримує адресу змінної
    printf("Значення змінної: %d\n", var);
    printf("Адреса змінної: %p\n", &var);
    printf("Значення вказівника: %p\n", ind);


    int var_2 = *ind;  // розіменування вказівника для отримання значення змінної, на яку він вказує та присвоєння цього значення новій змінній var_2
    printf("Значення змінної через вказівник: %d\n", var_2);
    *ind = 200; // зміна значення змінної через вказівник, розіменування вказівника для доступу до змінної та присвоєння нового значення
    printf("Значення змінної після зміни через вказівник: %d\n", var);
    printf("Значення var_2: %d\n", var_2); // var_2 зберігає старе значення, оскільки воно було присвоєно до зміни через вказівник. Зміна var не впливає на var_2, оскільки вони є окремими змінними.

    int arg = 9;
    int *a, *b;  // оголошення двох вказівників на тип short

    a = &arg;  // присвоєння адреси змінної arg вказівнику a
    b = a;  // присвоєння значення вказівника a вказівнику b, тепер обидва вказівники a і b вказують на ту ж адресу, що і arg
    printf("Значення вказівника a: %p\n, значення вказівника b; %p\n", a, b);
    
    return 0;
}
