#include <stdio.h>

/*
В С немає рядкового типу даних, використовують масиви типу char
Останній елемент масиву '\0' - знак закінчення рядка
Рядки знаходяться в незмінній облассті памяті, їх міняти не можна. Як правило в секцію .text
*/

int main(void)
{   
    char s[] = "String";  // Розібє на елементи та додасть '\0'
    char buffer[128] = "Hello";  // Заповнить 5 елементами, додасть знак '\0' інші елементи будуть невизначені
    char s_2[] = "Hel" "lo"
                    ", word";  // Компілятор збере "Hello, world"
    char s_4[] = "Hello, \
world"; // Компілятор збере "Hello, world"

    // Екранування і спецсимволи \"C\" - екрануємо за допомогою зворотнього слешу.

    return 0;
}