#include <stdio.h>
#include "func.h"  // Для власних файлів заголовків використовуємо лапки "", а не кутові дужки <>.

/*
Прототип функції

Прототип повідомляє компілятору ім'я функції, тип значення, яке вона повертає,
та типи її параметрів. Завдяки цьому функцію можна викликати до того, як у файлі
буде написана її реалізація.

Якщо реалізація функції знаходиться в іншому .c файлі, цей файл потрібно додати
до компіляції. Наприклад:
gcc 20_function_prototypes.c func.c -o program

#include не підключає .c файл з реалізацією. Він підставляє текст заголовка,
де зазвичай знаходяться прототипи, макроси та оголошення типів.

Щоб не дублювати прототипи в різних модулях, їх виносять у файл заголовка,
наприклад func.h, і підключають через директиву #include "func.h".

У файлі заголовка бажано використовувати захист від повторного підключення:
#ifndef FUNC_H
#define FUNC_H
...
#endif
*/


int sum_2(int a, int b);  // Імена параметрів у прототипі можна не вказувати: int sum_2(int, int);

int main(void){

    printf("sum = %d\n", sum_2(2, 4));
    printf("diff = %d\n", diff_2(6, 3));

    return 0;
}

int sum_2(int a, int b){
    return a + b;
}

int diff_2(int a, int b){
    return a - b;
}
