#include <stdio.h>
/*
Вказівник як параметр
У C можна передавати вказівники як параметри функцій. Це дозволяє функції отримувати доступ до змінних, які знаходяться поза її локальною областю видимості, і змінювати їх значення.
Наприклад, функція swap приймає два вказівники на int і міняє їх значення місцями. Функція sum_arr приймає вказівник на масив типу short і його розмір, а потім обчислює суму елементів масиву.
Такі функції можуть бути корисними для роботи з масивами, динамічною пам'яттю або для зміни значень змінних, які знаходяться в іншій області видимості.
*/

#define COLS 3

void swap(int *a, int *b) {
    /*
    Якщо спробувати поміняти місцями значення змінних a і b без використання вказівників, то це не спрацює, оскільки функція буде працювати з копіями значень, а не з оригінальними змінними. 
    Використання вказівників дозволяє функції отримати доступ до оригінальних змінних і змінити їх значення.
    */
    int temp = *a;  // Зберігаємо значення, на яке вказує a, у тимчасовій змінній. (temp = 5)
    *a = *b;    // Присвоюємо значення, на яке вказує b, змінній, на яку вказує a. ( *a =10)
    *b = temp;  // Присвоюємо тимчасове значення змінній, на яку вказує b. ( *b = 5)
}

int sum_arr(const short *arr, int length) {
    /*
    Функція sum_arr приймає вказівник на масив типу short і його розмір. Вона обчислює суму елементів масиву, використовуючи вказівник для доступу до кожного елемента.
    */
    int sum = 0;
    for(int i = 0; i < length; ++i) {
        sum += arr[i]; // Доступ до елементів масиву через індексацію
        // або можна використовувати арифметику вказівників: sum += *(arr + i);
    }
    return sum;
}

void print_2d_array(const short (*arr)[COLS], int rows) {
    /*
    Функція print_2d_array приймає кількість рядків, кількість стовпців і вказівник на двовимірний масив типу short. Вона виводить елементи масиву у вигляді таблиці.
    */
    for(int i = 0; i < rows; ++i) {
        for(int j = 0; j < COLS; ++j) {
            printf("%d ", arr[i][j]); // Доступ до елементів двовимірного масиву
        }
        printf("\n");
    }
} 

int main(void)
{
    
    // Реалізація функції, яка приймає вказівник на змінну типу short і змінює її значення. Сенсу в такій функції немає, але вона демонструє, як можна передавати вказівник як параметр.
    short var_a = 10;
    short *ptr_a = &var_a;
    *ptr_a = 20;

    int x = 5, y = 10; // Данні змінні є локальними для функції main, тому їхні значення не можуть бути змінені безпосередньо з іншої функції. 
    swap(&x, &y);  // Передаємо адреси змінних x і y у функцію swap, щоб вона могла змінити їх значення.

    short arr[] = {1, 2, 3, 4, 5};
    int res = sum_arr(arr, sizeof(arr) / sizeof(*arr)); // Передаємо масив і його розмір у функцію sum_arr для обчислення суми елементів.
    printf("Sum of array elements: %d\n", res);

    short arr_2[][COLS] = {{1, 2, 3}, {4, 5, 6}};
    print_2d_array(arr_2, 2);

    return 0;
}