#include <stdio.h>


/*
Вказівники на функції
У C можна створювати вказівники на функції, які дозволяють зберігати адреси функцій і викликати їх через ці вказівники. Це корисно для реалізації колбеків, динамічного вибору функцій або для створення масивів функцій.
Наприклад, можна створити вказівник на функцію, яка приймає два int і повертає int, а потім присвоїти йому адресу функції, яка виконує додавання або множення. Потім можна викликати цю функцію через вказівник, передаючи аргументи.
У цьому прикладі ми оголошуємо вказівник на функцію ptr_func, яка приймає два int і повертає int. 
*/  

#define SIZE 10

int sq_rect(int a, int b) {  // Імя функції є вказівником на неї, який можна використовувати для виклику функції.
    return a * b;
}

void filter(int dst[], size_t size_dist, const int src[], size_t size_src, int (*predicate)(int)) {
    /*
    Функція filter приймає два масиви (dst і src), їх розміри та вказівник на функцію predicate, яка приймає int і повертає int. Функція filter копіює елементи з масиву src до масиву dst, якщо вони задовольняють умову, визначену функцією predicate.
    */
    size_t j = 0;
    for(int i = 0; i < size_dist; ++i)
        dst[i] = 0; // Ініціалізуємо масив dst нулями.

    for(int i = 0, j = 0; i < size_src; ++i)
        if(predicate(src[i])) // Викликаємо функцію predicate через вказівник, передаючи їй елемент src[i].
            dst[j++] = src[i]; // Якщо predicate повертає істину, копіюємо елемент до dst і збільшуємо індекс j.
}

int is_even(int x) {
    return x % 2 == 0; // Функція, яка перевіряє, чи є число парним.
}

int main(void){

    int (*ptr_func)(int, int); // Оголошуємо вказівник на функцію, яка приймає два int і повертає int. Синтаксис: тип_повернення (*імя_вказівника)(тип_параметрів).
    ptr_func = sq_rect;  // Оголошуємо вказівник на функцію, яка приймає два int і повертає int. Присвоюємо йому адресу функції sq_rect.

    printf("sq_rect: %p\n", sq_rect);  // Виводимо адресу функції sq_rect. Це вказівник на функцію.
    printf("ptr_func: %p\n", ptr_func);  // Виводимо адресу функції через вказівник.

    int digits[8] = {1, 2, 3, 4, 5, 6, 7, 8};
    int result[SIZE];

    filter(result, SIZE, digits, sizeof(digits) / sizeof(*digits), is_even); // Викликаємо функцію filter, передаючи їй масив result для збереження результатів, розмір масиву result, масив digits як джерело даних, розмір масиву digits та вказівник на функцію is_even як предикат для фільтрації.

    return 0;
}