#include <iostream>



// нові типи для С++ на відміну від С
bool fl = true; // бульовий тип 1 байт, true false
wchar_t wch = L'л';  // розширений символьний тип, 2 байти віндовс, 4 байти лінукс
// цифра означає кіькість біт, для символів UTF-8, доданий в стандарі С++20
// char8_t a = 1;
char16_t b = 22;
char32_t c = 33;

using std::cout;
using std::cin;
using std::endl;


int main() {

    int val(10);  // в с++ новий спосіб ініціалізазації(функціональна фнотація)
    char ch{'b'};  // ініціалізація за допомогою фігурних лапок, додатково відбувається перевірка типу
    long ls{};  // ініціалізується як 0
    const double pi {3.1415};

    // c++ 11, змінилась функціонал auto - використовувалось для позначення автоматичниз змінних які знаходились в стековому фреймі
    // можна оголошувати змінні типу який можна вирахувати
    auto ff = 100;  // приведе до типу інт

    int* ptr = nullptr;
    int k;
    int& lk = k;

    auto t1 = k;     // int
    auto t2 = *ptr;  // int присвоюється тип вказівника
    auto t3 = ptr;   // int * буде вказівником
    auto t4 = &ptr;  // int **  буде вказівником на вказівкик
    auto t5 = lk;    // int

    return 0;
}