#include <iostream>

/*
Статична локальна змінна:
- створюється один раз;
- живе до завершення програми;
- зберігає своє значення між викликами функції.
*/

void show_static()
{
    static int counter = 0;
    std::cout << counter++ << std::endl;
}


class Point{
    // Тут ми тільки оголошуємо змінні а не ініціалізуємо по факту тут змінних не існує. Ініціалізація при створення обєкту класу
    int x, y;
public:
    /*
    Статичне поле класу:
    - одна копія на весь клас;
    - спільна для всіх об’єктів;
    - існує незалежно від створення об’єктів.
    */
    static unsigned point_counter;
    Point() : x(0), y(0)
        { point_counter++; } // При створення нового обєкту буде інкрементація змінної

    /*
    Статичний метод:
    - належить класу, а не конкретному об’єкту;
    - не має this;
    - може працювати лише зі статичними даними або іншими статичними методами.
    */
    static unsigned get_counter()
    {
        return point_counter;
    }
};

unsigned Point::point_counter = 0;  // Ініціалізуємо, так як буде помилка.

int main()
{
    // Викликали три рази кожен раз буде інкремент так як змінна каунтер є статичною і інує весь час життя програми.
    show_static();
    show_static();
    show_static();

    Point pt1, pt2;

    // До статичної змінної маємо доступ як через клас так і через обєкт класу. Вивід буде 2 так як створено два обєкти класу.
    std::cout << pt1.point_counter << std::endl;
    std::cout << Point::point_counter << std::endl;

    return 0;
}